// This Library is based on this articles.
// https://conansjh20.tistory.com/m/51
// https://conansjh20.tistory.com/m/52

public struct Hangul2Kana {
    
    static let hangulList: Array<Array<String>> = [["아"], ["카", "까"], ["사"], ["타", "따"], ["나"], ["하"], ["마"], ["야"], ["라"], ["와"], ["가"], ["자"], ["다"], ["바"], ["파", "빠"], ["캬", "꺄"], ["샤"], ["챠"], ["냐"], ["햐"], ["먀"], ["랴"], ["갸"], ["쟈"], ["뱌"], ["퍄", "뺘"], ["이"], ["키", "끼"], ["시"], ["치", "찌"], ["니"], ["히"], ["미"], ["리"], ["기"], ["지"], ["디"], ["비"], ["피", "삐"], ["우"], ["쿠", "꾸"], ["스", "수"], ["쯔", "츠"], ["누", "느"], ["후", "흐"], ["무", "므"], ["유"], ["루"], ["구", "그"], ["주", "즈"], ["두", "드"], ["부", "브"], ["푸", "프", "뿌", "쁘"], ["큐", "뀨"], ["슈"], ["츄", "쮸"], ["뉴"], ["휴"], ["뮤"], ["류"], ["규"], ["쥬"], ["뷰"], ["퓨", "쀼"], ["에"], ["케", "께"], ["세"], ["테", "떼"], ["네"], ["헤"], ["메"], ["레"], ["게"], ["제"], ["데"], ["베"], ["페", "뻬"], ["오"], ["코", "꼬"], ["소"], ["토", "또"], ["노"], ["호"], ["모"], ["요"], ["로"], ["고"], ["조"], ["도"], ["보"], ["포", "뽀"], ["쿄"], ["쇼"], ["쵸"], ["뇨"], ["효"], ["묘"], ["료"], ["교"], ["죠"], ["뵤"], ["표"], ["앗", "앋"], ["캇", "칻", "깟", "깓"], ["삿", "삳"], ["탓", "탇", "땃", "딷"], ["낫", "낟"], ["핫", "핟"], ["맛", "맏"], ["얏", "얃"], ["랏", "랃"], ["왓", "왇"], ["갓", "갇"], ["잣", "잗"], ["닷", "닫"], ["밧", "받"], ["팟", "팓", "빳", "빧"], ["캿", "캳", "꺗", "꺋"], ["샷", "샫"], ["챳", "챧", "짯", "짣"], ["냣", "냗"], ["햣", "햗"], ["먓", "먇"], ["럇", "랻"], ["걋", "갿"], ["쟛", "쟏"], ["뱟", "뱓"], ["퍗", "퍋"], ["잇", "읻"], ["킷", "킫", "낏", "낃"], ["싯", "싣"], ["칫", "칟", "찟", "찓"], ["닛", "닏"], ["힛", "힏"], ["밋", "믿"], ["릿", "릳"], ["깃", "긷"], ["짓", "짇"], ["딧", "딛"], ["빗", "빋"], ["핏", "핃", "삣", "삗"], ["웃", "욷"], ["쿳", "쿧"], ["슷", "슫"], ["쯧", "쯛"], ["눗", "눋"], ["훗", "훋"], ["뭇", "묻"], ["윳", "윧"], ["룻", "룯"], ["굿", "굳"], ["즛", "즏"], ["듯", "듣"], ["붓", "붇"], ["풋", "푿", "뿟", "뿓"], ["큣", "큗", "뀻", "뀯"], ["슛", "슏"], ["츗", "츋", "쯋", "쮿"], ["늇", "뉻"], ["흇", "휻"], ["뮷", "뮫"], ["륫", "륟"], ["귯", "귣"], ["쥿", "쥳"], ["븃", "뷷"], ["퓻", "퓯"], ["엣", "엗"], ["켓", "켇"], ["셋", "섿"], ["텟", "텓"], ["넷", "넫"], ["헷", "헫"], ["멧", "멛"], ["렛", "렏"], ["겟", "겓"], ["젯", "젣"], ["뎃", "덷"], ["벳", "벧"], ["펫", "펟", "뻿", "뻳"], ["옷", "옫"], ["콧", "콛", "꼿", "꼳"], ["솟", "솓"], ["톳", "톧", "똣", "똗"], ["놋", "녿"], ["홋", "혿"], ["못", "몯"], ["욧", "욛"], ["롯", "롣"], ["곳", "곧"], ["좃", "졷"], ["돗", "돋"], ["봇", "볻"], ["폿", "폳"], ["쿗", "쿋", "꾯", "꾣"], ["숏", "숃"], ["춋", "쵿", "쬿", "쬳"], ["뇻", "뇯"], ["횻", "횯"], ["묫", "묟"], ["룟", "룓"], ["굣", "굗"], ["죳", "죧"], ["뵷", "뵫"], ["푯", "푣", "뿃", "뾷"], ["안", "앙"], ["칸", "캉", "깐", "깡"], ["산", "상"], ["탄", "탕", "딴", "땅"], ["난", "낭"], ["한", "항"], ["만", "망"], ["얀", "양"], ["란", "량"], ["완", "왕"], ["간", "강"], ["잔", "장"], ["단", "당"], ["반", "방"], ["판", "팡", "빤", "빵"], ["캰", "컁", "꺈", "꺙"], ["샨", "샹"], ["챤", "챵"], ["냔", "냥"], ["햔", "향"], ["먄", "먕"], ["랸", "량"], ["갼", "걍"], ["쟌", "쟝"], ["뱐", "뱡"], ["퍈", "퍙", "뺜", "뺭"], ["인", "잉"], ["킨", "킹", "낀", "낑"], ["신", "싱"], ["찐", "찡", "친", "칭"], ["닌", "닝"], ["힌", "힝"], ["민", "밍"], ["린", "링"], ["긴", "깅"], ["진", "징"], ["딘", "딩"], ["빈", "빙"], ["핀", "핑", "삔", "삥"], ["운", "웅"], ["쿤", "쿵", "꾼", "꿍"], ["슨", "승", "순", "숭"], ["쯘", "쯩"], ["는", "능", "눈", "눙"], ["훈", "훙", "흔", "흥"], ["문", "뭉", "믄", "믕"], ["윤", "융"], ["룬", "룽", "른", "릉"], ["군", "궁"], ["즌", "증"], ["든", "등"], ["분", "붕", "븐", "븡"], ["푼", "풍", "뿐", "뿡"], ["큔", "큥", "뀬", "뀽"], ["슌", "슝"], ["츈", "츙", "쮼", "쯍"], ["뉸", "늉"], ["휸", "흉"], ["뮨", "뮹"], ["륜", "륭"], ["균", "귱"], ["쥰", "즁"], ["뷴", "븅"], ["퓬", "퓽", "쁀", "쁑"], ["엔", "엥"], ["켄", "켕"], ["센", "셍"], ["텐", "텡", "뗀", "뗑"], ["넨", "넹"], ["헨", "헹"], ["멘", "멩"], ["렌", "렝"], ["겐", "겡"], ["젠", "젱"], ["덴", "뎅"], ["벤", "벵"], ["펜", "펭", "뻰", "뼁"], ["온", "옹"], ["콘", "콩", "꼰", "꽁"], ["손", "송"], ["톤", "통", "똔", "똥"], ["논", "농"], ["혼", "홍"], ["몬", "몽"], ["욘", "용"], ["론", "롱"], ["곤", "공"], ["존", "종"], ["돈", "동"], ["본", "봉"], ["폰", "퐁", "뽄", "뽕"], ["쿈", "쿙", "꾠", "꾱"], ["숀", "숑"], ["쵼", "춍", "쬰", "쭁"], ["뇬", "뇽"], ["횬", "횽"], ["묜", "묭"], ["룐", "룡"], ["굔", "굥"], ["죤", "죵"], ["뵨", "뵹"], ["푠", "푱"], ["화"], ["휘"], ["훠"], ["훼"], ["봐"], ["뷔"], ["붜"], ["붸"], ["위"], ["워"], ["웨"], ["티"], ["뎨"], ["ㅗ"], ["ㅡ", "-"], [" "], ["."]]
    
    static let hiraganaList: Array<String> = ["あ", "か", "さ", "た", "な", "は", "ま", "や", "ら", "わ", "が", "ざ", "だ", "ば", "ぱ", "きゃ", "しゃ", "ちゃ", "にゃ", "ひゃ", "みゃ", "りゃ", "ぎゃ", "じゃ", "びゃ", "ぴゃ", "い", "き", "し", "ち", "に", "ひ", "み", "り", "ぎ", "じ", "ぢ", "び", "ぴ", "う", "く", "す", "つ", "ぬ", "ふ", "む", "ゆ", "る", "ぐ", "ず", "づ", "ぶ", "ぷ", "きゅ", "しゅ", "ちゅ", "にゅ", "ひゅ", "みゅ", "りゅ", "ぎゅ", "じゅ", "びゅ", "ぴゅ", "え", "け", "せ", "て", "ね", "へ", "め", "れ", "げ", "ぜ", "で", "べ", "ぺ", "お", "こ", "そ", "と", "の", "ほ", "も", "よ", "ろ", "ご", "ぞ", "ど", "ぼ", "ぽ", "きょ", "しょ", "ちょ", "にょ", "ひょ", "みょ", "りょ", "ぎょ", "じょ", "びょ", "ぴょ", "あっ", "かっ", "さっ", "たっ", "なっ", "はっ", "まっ", "やっ", "らっ", "わっ", "がっ", "ざっ", "だっ", "ばっ", "ぱっ", "きゃっ", "しゃっ", "ちゃっ", "にゃっ", "ひゃっ", "みゃっ", "りゃっ", "ぎゃっ", "じゃっ", "びゃっ", "ぴゃっ", "いっ", "きっ", "しっ", "ちっ", "にっ", "ひっ", "みっ", "りっ", "ぎっ", "じっ", "ぢっ", "びっ", "ぴっ", "うっ", "くっ", "すっ", "つっ", "ぬっ", "ふっ", "むっ", "ゆっ", "るっ", "ぐっ", "ずっ", "づっ", "ぶっ", "ぷっ", "きゅっ", "しゅっ", "ちゅっ", "にゅっ", "ひゅっ", "みゅっ", "りゅっ", "ぎゅっ", "じゅっ", "びゅっ", "ぴゅっ", "えっ", "けっ", "せっ", "てっ", "ねっ", "へっ", "めっ", "れっ", "げっ", "ぜっ", "でっ", "べっ", "ぺっ", "おっ", "こっ", "そっ", "とっ", "のっ", "ほっ", "もっ", "よっ", "ろっ", "ごっ", "ぞっ", "どっ", "ぼっ", "ぽっ", "きょっ", "しょっ", "ちょっ", "にょっ", "ひょっ", "みょっ", "りょっ", "ぎょっ", "じょっ", "びょっ", "ぴょっ", "あん", "かん", "さん", "たん", "なん", "はん", "まん", "やん", "らん", "わん", "がん", "ざん", "だん", "ばん", "ぱん", "きゃん", "しゃん", "ちゃん", "にゃん", "ひゃん", "みゃん", "りゃん", "ぎゃん", "じゃん", "びゃん", "ぴゃん", "いん", "きん", "しん", "ちん", "にん", "ひん", "みん", "りん", "ぎん", "じん", "ぢん", "びん", "ぴん", "うん", "くん", "すん", "つん", "ぬん", "ふん", "むん", "ゆん", "るん", "ぐん", "ずん", "づん", "ぶん", "ぷん", "きゅん", "しゅん", "ちゅん", "にゅん", "ひゅん", "みゅん", "りゅん", "ぎゅん", "じゅん", "びゅん", "ぴゅん", "えん", "けん", "せん", "てん", "ねん", "へん", "めん", "れん", "げん", "ぜん", "でん", "べん", "ぺん", "おん", "こん", "そん", "とん", "のん", "ほん", "もん", "よん", "ろん", "ごん", "ぞん", "どん", "ぼん", "ぽん", "きょん", "しょん", "ちょん", "にょん", "ひょん", "みょん", "りょん", "ぎょん", "じょん", "びょん", "ぴょん", "", "", "", "", "", "", "", "", "", "", "", "", "", "を", "ー", " ", "。"]
    
    static let katakanaList: Array<String> = ["ア", "カ", "サ", "タ", "ナ", "ハ", "マ", "ヤ", "ラ", "ワ", "ガ", "ザ", "ダ", "バ", "パ", "キャ", "シャ", "チャ", "ニャ", "ヒャ", "ミャ", "リャ", "ギャ", "ジャ", "ビャ", "ピャ", "イ", "キ", "シ", "チ", "ニ", "ヒ", "ミ", "リ", "ギ", "ジ", "ヂ", "ビ", "ピ", "ウ", "ク", "ス", "ツ", "ヌ", "フ", "ム", "ユ", "ル", "グ", "ズ", "ヅ", "ブ", "プ", "キュ", "シュ", "チュ", "ニュ", "ヒュ", "ミュ", "リュ", "ギュ", "ジュ", "ビュ", "ピュ", "エ", "ケ", "セ", "テ", "ネ", "ヘ", "メ", "レ", "ゲ", "ゼ", "デ", "ベ", "ペ", "オ", "コ", "ソ", "ト", "ノ", "ホ", "モ", "ヨ", "ロ", "ゴ", "ゾ", "ド", "ボ", "ポ", "キョ", "ショ", "チョ", "ニョ", "ヒョ", "ミョ", "リョ", "ギョ", "ジョ", "ビョ", "ピョ", "アッ", "カッ", "サッ", "タッ", "ナッ", "ハッ", "マッ", "ヤッ", "ラッ", "ワッ", "ガッ", "ザッ", "ダッ", "バッ", "パッ", "キャッ", "シャッ", "チャッ", "ニャッ", "ヒャッ", "ミャッ", "リャッ", "ギャッ", "ジャッ", "ビャッ", "ピャッ", "イッ", "キッ", "シッ", "チッ", "ニッ", "ヒッ", "ミッ", "リッ", "ギッ", "ジッ", "ヂッ", "ビッ", "ピッ", "ウッ", "クッ", "スッ", "ツッ", "ヌッ", "フッ", "ムッ", "ユッ", "ルッ", "グッ", "ズッ", "ヅッ", "ブッ", "プッ", "キュッ", "シュッ", "チュッ", "ニュッ", "ヒュッ", "ミュッ", "リュッ", "ギュッ", "ジュッ", "ビュッ", "ピュッ", "エッ", "ケッ", "セッ", "テッ", "ネッ", "ヘッ", "メッ", "レッ", "ゲッ", "ゼッ", "デッ", "ベッ", "ペッ", "オッ", "コッ", "ソッ", "トッ", "ノッ", "ホッ", "モッ", "ヨッ", "ロッ", "ゴッ", "ゾッ", "ドッ", "ボッ", "ポッ", "キョッ", "ショッ", "チョッ", "ニョッ", "ヒョッ", "ミョッ", "リョッ", "ギョッ", "ジョッ", "ビョッ", "ピョッ", "アン", "カン", "サン", "タン", "ナン", "ハン", "マン", "ヤン", "ラン", "ワン", "ガン", "ザン", "ダン", "バン", "パン", "キャン", "シャン", "チャン", "ニャン", "ヒャン", "ミャン", "リャン", "ギャン", "ジャン", "ビャン", "ピャン", "イン", "キン", "シン", "チン", "ニン", "ヒン", "ミン", "リン", "ギン", "ジン", "ヂン", "ビン", "ピン", "ウン", "クン", "スン", "ツン", "ヌン", "フン", "ムン", "ユン", "ルン", "グン", "ズン", "ヅン", "ブン", "プン", "キュン", "シュン", "チュン", "ニュン", "ヒュン", "ミュン", "リュン", "ギュン", "ジュン", "ビュン", "ピュン", "エン", "ケン", "セン", "テン", "ネン", "ヘン", "メン", "レン", "ゲン", "ゼン", "デン", "ベン", "ペン", "オン", "コン", "ソン", "トン", "ノン", "ホン", "モン", "ヨン", "ロン", "ゴン", "ゾン", "ドン", "ボン", "ポン", "キョン", "ション", "チョン", "ニョン", "ヒョン", "ミョン", "リョン", "ギョン", "ジョン", "ビョン", "ピョン", "ファ", "フィ", "フゥ", "フェ", "ヴァ", "ヴィ", "ヴゥ", "ヴェ", "ウィ", "ウゥ", "ウェ", "ティ", "ディ", "ヲ", "ー", " ", "。"]
    
    public static func toHiragana(word:String) -> String {
        var hangulChars: Array<String> = []
        var convertedChars: Array<String> = []
        
        word.forEach { char in
            hangulChars.append(String(char))
        }
        
        hangulChars.forEach { eachChar in
            for i in 0...(hangulList.count-1) {
                if hangulList[i].contains(eachChar) {
                    convertedChars.append(hiraganaList[i])
                }
            }
        }
        
        return convertedChars.joined(separator: "")
    }
    
    public static func toKatakana(word:String) -> String {
        var hangulChars: Array<String> = []
        var convertedChars: Array<String> = []
        
        word.forEach { char in
            hangulChars.append(String(char))
        }
        
        hangulChars.forEach { eachChar in
            for i in 0...(hangulList.count-1) {
                if hangulList[i].contains(eachChar) {
                    convertedChars.append(katakanaList[i])
                }
            }
        }
        
        return convertedChars.joined(separator: "")
    }
}
